Repository: emrecoskun705/Unitagram
Catalog: src/Infrastructure/Unitagram.Infrastructure/Localization/Resources.*.resx
Languages: tr

# Identity.ConcurrencyFailure
source: Data conflict error during update.
tr: Güncelleme sırasında veri çakışması hatası.

# Identity.PasswordMismatch
source: Incorrect password.
tr: Yanlış şifre.

# Identity.InvalidToken
source: Invalid token.
tr: Geçersiz token.

# Identity.RecoveryCodeRedemptionFailed
source: Failure in redeeming recovery code.
tr: Kurtarma kodunu kullanma hatası.

# Identity.LoginAlreadyAssociated
source: External login is already associated with an account.
tr: Başka bir hesapta giriş yapılmıştır.

# Identity.InvalidUserName
source: The specified username is invalid.
tr: Belirtilen kullanıcı adı geçersiz.

# Identity.InvalidEmail
source: The specified email is invalid.
tr: Belirtilen e-posta geçersiz.

# Identity.DuplicateUserName
source: The specified username already exists.
tr: Belirtilen kullanıcı adı zaten var.

# Identity.DuplicateEmail
source: Email is already associated with an account.
tr: E-posta zaten bir hesapla ilişkilendirilmiş.

# Identity.InvalidRoleName
source: Role name is invalid.
tr: Rol adı geçersiz.

# Identity.DuplicateRoleName
source: Eole name already exists.
tr: Rol adı zaten var.

# Identity.UserAlreadyHasPassword
source: User already has a password.
tr: Kullanıcının zaten bir şifresi var.

# Identity.UserLockoutNotEnabled
source: User lockout is not enabled.
tr: Kullanıcı kilitleme etkin değil.

# Identity.UserNotInRole
source: User is not in the specified role.
tr: Kullanıcı belirtilen rolde değil.

# Identity.PasswordTooShort
source: Password does not meet minimum length requirements.
tr: Şifre minimum uzunluk gereksinimlerini karşılamıyor.

# Identity.PasswordRequiresUniqueChars
source: Password does not meet the minimum number of unique characters.
tr: Şifre minimum benzersiz karakter sayısını karşılamıyor.

# Identity.PasswordRequiresNonAlphanumeric
source: Password must contain a non-alphanumeric character.
tr: Şifre alfasayısal olmayan bir karakter içermelidir.

# Identity.PasswordRequiresDigit
source: Password must contain a numeric character.
tr: Şifre sayısal bir karakter içermelidir.

# Identity.PasswordRequiresLower
source: Password must contain a lowercase letter.
tr: Şifre küçük harf içermelidir.

# Identity.PasswordRequiresUpper
source: Password must contain an uppercase letter.
tr: Şifre büyük harf içermelidir.

# Identity.UserAlreadyInRole
source: User is already in the specified role.
tr: Kullanıcı zaten belirtilen rolde.

# Identity.DefaultError
source: Undefined error.
tr: Tanımlanmamış hata.

# AccountLockout
source: Please try again in {0} minutes later.
tr: Lütfen {0} dakika sonra tekrar deneyiniz.

# ConfirmPasswordCantBlank
source: Confirm password can't be blank
tr: Şifreyi onayla boş olmamalıdır.

# EmailAlreadyConfirmedException
source: Your email has already been confirmed successfully!
tr: E-postanız daha önce onaylanmıştır.

# EmailCantBlank
source: Email can not be blank.
tr: Mail adresi boş olmamalıdır.

# EmailInvalidCodeException
source: Code is not correct. You have got {0} left.
tr: Kod doğru değil. {0} hakkınız kaldı.

# EmailInvalidFormat
source: Email should be in a proper email address format
tr: Mail adresi düzgün bir formatta olmalıdır.

# EmailOtpNotFoundException
source: Code not found. Please resend code.
tr: Kod bulunamadı. Lütfen kodu tekrar gönderiniz.

# InvalidAccountCredentials
source: Account login information is invalid.
tr: Hesap giriş bilgileri geçersiz.

# InvalidUsername
source: Invalid username, please change your username.
tr: Kullanıcı adı geçersiz, lütfen değiştiriniz.

# OtpCodeTryAgainLaterException
source: Please wait for {0} minutes before attempting to create new code again.
tr: Yeni kod oluşturmak için lütfen tekrar {0} dakika sonra deneyin.

# PasswordContainLowercase
source: Password must contain at least one lowercase letter.
tr: Şifre en az 1 küçük harf içermelidir.

# PasswordContainUppercase
source: Password must contain at least one uppercase letter.
tr: Şifre en az 1 büyük harf içermelidir.

# PasswordMaxChar
source: Password should be maximum of 50 characters.
tr: Şifre en fazla 50 karakter olmalıdır.

# PasswordMaxLength
source: Password should be maximum of 50 characters long
tr: Şifre en fazla 50 karakter olmalıdır.

# PasswordMinLength
source: Password should be minimum 8 characters long
tr: Şifre en az 8 karakter olmalıdır.

# PasswordNotEquals
source: Şifre ve şifreyi onayla eşleşmiyor.
tr: Password and confirm password does not match.

# PasswordShouldntEmpty
source: Password shouldn't be empty.
tr: Şifre boş olmamalı.

# PhoneNumberOnlyDigit
source: Phone number should contain only digits.
tr: Telefon numarası sadece rakamlardan oluşmalıdır.

# ReachedMaximumCodeUsageException
source: You've reached maximum code usage. Please resend code again.
tr: Maksimum tekrar sayısına ulaştınız. Lütfen kodu tekrar gönderiniz.

# TokenNotEmpty
source: Token can't be empty. Please log in again.
tr: Giriş anahtarın boş olmamalıdır. Lütfen tekrar giriş yapmayı deneyiniz.

# UniversityDomainNotFound
source: There is no university for given domain.
tr: Mail adresi için bir üniversite bulunamadı.

# UsernameExists
source: Username already exists.
tr: Kullanıcı adı kullanılıyor.

# UsernameMaxChar
source: Username should be maximum of 100 characters.
tr: Kullanıcı adı en fazla 100 karakter olmalıdır.

# UsernameMaxLength
source: Username should be maximum of 15 characters long
tr: Kullanıcı adı en fazla 15 karakterden oluşmalıdır.

# UsernameMinLength
source: Username should be minimum 4 characters long
tr: Kullanıcı adı en az 4 karakterden oluşmalıdır.

source: Username not found.
tr: Kullanıcı adı bulunamadı.

# UsernameShouldntEmpty
source: Username shouldn't be empty.
tr: Kullanıcı adı boş olmamalı.

source: User not found.
tr: Kullanıcı bulunamadı.

# User.InvalidCredentials
source: Account login information is invalid.
tr: Hesap giriş bilgileri geçersiz.
